app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("post_id", "user_id", "content", "created_at", "updated_at", "username", "name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["post_id", 12], ["user_id", 3], ["content", "give up"], ["created_at", "2020-07-14 01:12:51.054123"], ["updated_at", "2020-07-14 01:12:51.054123"], ["username", "pcho"], ["name", "Peter Cho"]]