app/controllers/comments_controller.rb

    def set_comment
      # @comment = Comment.find(params[:id])
      @comment = Comment.where(post_id: params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 15]]