app/controllers/follows_controller.rb

SELECT "follows".* FROM "follows"
---
  def index
    @follows = Follow.all

INSERT INTO "follows" ("follower_id", "following_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 4], ["following_id", 5], ["created_at", "2020-07-15 23:13:02.746097"], ["updated_at", "2020-07-15 23:13:02.746097"]]
---
  def create
    @follow = Follow.new(follow_params)

    if @follow.save