app/controllers/likes_controller.rb

  def create
    @like = Like.new(like_params)

    if @like.save
---
INSERT INTO "likes" ("user_id", "post_id", "comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["post_id", 19], ["comment_id", 0], ["created_at", "2020-07-14 19:00:54.715102"], ["updated_at", "2020-07-14 19:00:54.715102"]]

  def destroy
    @like.destroy
---
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 2]]

    def set_like
      @like = Like.find(params[:id])
---
SELECT "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]