app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("user_id", "content", "created_at", "updated_at", "username", "name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 3], ["content", "Testing"], ["created_at", "2020-07-13 23:26:50.759133"], ["updated_at", "2020-07-13 23:26:50.759133"], ["username", "pcho"], ["name", "Peter Cho"]]