app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "pcho"], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(username: params[:id])

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE (username = NULL) ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def set_user
      @user = User.where(["username = ?", params[:username]]).first